# Keyspace Test

In [1]:
import pandas as pd
import cassandra
from cassandra.cluster import Cluster
from cassandra.query import dict_factory

In [2]:
cluster = Cluster(['127.0.0.1'])
session = cluster.connect()

session.row_factory = dict_factory

## Checking keyspace

In [3]:
rows = session.execute("SELECT * FROM system_schema.keyspaces;")

for row in rows:
    if 'system' in row['keyspace_name']:
        continue
    else:
        print(row['keyspace_name'])

music_library

## Checking tables

In [4]:
rows = session.execute("SELECT * FROM system_schema.tables WHERE keyspace_name = 'music_library';")

for row in rows:
    print(row['table_name'])

session_library
song_library
user_library

## Checking queries

In [5]:
session.set_keyspace('music_library')

In [6]:
def results_to_frame(rows):
    """Transfrom Cassanadra results to DataFrame"""
    results = []
    for row in rows:
        results.append(row)
    df_results = pd.DataFrame(results)
    return df_results

### Session DB

#### Test 1

In [7]:
sessiondb_test_query = '''
    SELECT artist_name, song_title, song_length 
    FROM session_library 
    WHERE session_id=338 AND item_in_session=4;
'''

try:
    rows = session.execute(sessiondb_test_query)
except Exception as e:
    print(e)

In [8]:
results_to_frame(rows)

  artist_name  song_length                       song_title
0   Faithless   495.307312  Music Matters (Mark Knight Dub)

#### Test 2

In [9]:
sessiondb_test_query = '''
    SELECT artist_name, song_title, song_length 
    FROM session_library 
    WHERE session_id=42;
'''

try:
    rows = session.execute(sessiondb_test_query)   
except Exception as e:
    print(e)

In [10]:
results_to_frame(rows)

   artist_name  song_length        song_title
0   Gary Hobbs   245.524445       En Mi Mundo
1    Lifehouse   203.597916  We'll Never Know
2  Olivia Ruiz   254.745667    Cabaret Blanco

### User DB

#### Test 1

In [11]:
userdb_test_query = '''
    SELECT artist_name, song_title, user_first_name, user_last_name 
    FROM user_library 
    WHERE user_id = 10 AND session_id = 182
    ORDER BY item_in_session ASC;
'''

try:
    rows = session.execute(userdb_test_query)
except Exception as e:
    print(e)

In [12]:
results_to_frame(rows)

,artist_name,song_title,user_first_name,user_last_name
0,Down To The Bone,Keep On Keepin' On,Sylvie,Cruz
1,Three Drives,Greece 2000,Sylvie,Cruz
2,Sebastien Tellier,Kilometer,Sylvie,Cruz
3,Lonnie Gordon,Catch You Baby (Steve Pitron & Max Sanna Radio...,Sylvie,Cruz

#### Test 2

In [13]:
userdb_test_query = '''
    SELECT artist_name, song_title, user_first_name, user_last_name 
    FROM user_library 
    WHERE user_id = 80 AND session_id = 435
    ORDER BY item_in_session ASC;
'''

try:
    rows = session.execute(userdb_test_query)
except Exception as e:
    print(e)

In [14]:
results_to_frame(rows)

,artist_name,song_title,user_first_name,user_last_name
0,Miike Snow,Black & Blue,Tegan,Levine
1,Cartola,Sala De RecepÃÂ§ÃÂ£o,Tegan,Levine
2,Kill The Client,Commander In Thief,Tegan,Levine
3,Wolfmother,Woman,Tegan,Levine
4,Old Crow Medicine Show,Wagon Wheel,Tegan,Levine
5,Architecture In Helsinki,Debbie,Tegan,Levine
6,Charlie Louvin,I Think I'll Live,Tegan,Levine
7,Miguel Morales,La Derrota de Un Don Juan,Tegan,Levine
8,Dominique A,Le Courage Des Oiseaux,Tegan,Levine
9,Cock Sparrer,Run With The Blind,Tegan,Levine
10,Jimmy Wakely,I Love You So Much It Hurts,Tegan,Levine
11,Peter Doherty,A Little Death Around the Eyes,Tegan,Levine
12,Katy Perry,Thinking Of You,Tegan,Levine

### Song DB

#### Test 1

In [15]:
songdb_test_query = '''
    SELECT user_first_name, user_last_name 
    FROM song_library 
    WHERE song_title = 'All Hands Against His Own';
'''

try:
    rows = session.execute(songdb_test_query)
except Exception as e:
    print(e)

In [16]:
results_to_frame(rows)

  user_first_name user_last_name
0      Jacqueline          Lynch
1           Tegan         Levine
2            Sara        Johnson

#### Test 2

In [17]:
songdb_test_query = '''
    SELECT user_first_name, user_last_name 
    FROM song_library 
    WHERE song_title = 'Yellow';
'''

try:
    rows = session.execute(songdb_test_query)
except Exception as e:
    print(e)

In [18]:
results_to_frame(rows)

  user_first_name user_last_name
0            Lily           Koch
1           Layla        Griffin
2      Jacqueline          Lynch
3           Chloe         Cuevas
4       Katherine            Gay
5           Emily         Benson
6            Colm        Santana
7           Tegan         Levine
8         Kinsley          Young
9            Kate        Harrell